CDiamondGit/stm32SpaceInvaders/src/main.c
        }
        if (selectedOption==2) {
          *as = RECORD;
          done = 1;
        }
        
      }
      
    }
  }
  
  
  void help(AppState *as) {
    clearDisplay();
    
    int done =0;
    
    while (!done) {
      printTextX2("HELP", 40, 0, RGBToWord(255,255,0), 0);
      
      printText("Control spaceship:", 0, 20, RGBToWord(255,255,255), 0);
      printText("Left/Right buttons",0,30,RGBToWord(255,255,255),0);
      printText("FIRE = UP BUTTON", 0, 60, RGBToWord(255,255,255), 0);
      printText("PAUSE = DOWN BUTTON", 0, 80, RGBToWord(255,255,255), 0);
      
      printText("EXIT HELP = DOWN BUTTON", 0,120, RGBToWord(255,255,255),0);
      
      
      if ((GPIOA->IDR & (1 << 11)) == 0) {
        
        *as = MAINMENU;
        done =1;
        
      }
    }
  }
  
  
  
  
  /*
  * 7. INPUT
  *
  */
  static void handleInput(void) {
    /* Right – PB4 */
    if ((GPIOB->IDR & (1 << 4)) == 0) {
      if (gs.ship.coords.x < SHIP_MAX_X)
      gs.ship.coords.x += gs.ship.speed;
    }
    
    /* Left – PB5 */
    if ((GPIOB->IDR & (1 << 5)) == 0) {
      if (gs.ship.coords.x > SHIP_MIN_X)
      gs.ship.coords.x -= gs.ship.speed;
    }
    
    /* Fire – PA8 */
    if ((GPIOA->IDR & (1 << 8)) == 0) {
      if (gs.bullet.state == BULLET_READY)
      gs.bullet.state = BULLET_FIRE;
    }
  }
  
  /*
  * 8. ALIEN MOVEMENT
  *
  */
  
  /*
  *@isAlienGridMt(void)
  *returns 1 if none of the alien is alive, else 0
  */
  
  static int isAlienGridMt(void) {
    AlienGrid* ag = &gs.aliens;
    for (int i = 0; i < ALIEN_ROWS; i++) {
      for (int j = 0; j < ALIEN_COLS; j++) {
        if (ag->status[i][j] == 0) {
          return 0;
        }
      }
    }
    return 1;
  }
  
  /*
  *@getLowestAlienY(void) -> return-type: uint16_t
  *returns Y position of lowest alive alien if not then 0 (ie no alien alive)
  */
  
  static uint16_t getLowestAlienY(void) {
    AlienGrid* ag = &gs.aliens;
    for (int i = ALIEN_ROWS - 1; i >= 0; i--) {
      for (int j = 0; j < ALIEN_COLS; j++) {
        if (ag->status[i][j] == 0) {
          // lowest alive alien Y position
          return (uint16_t)(ag->offsetY + ag->basePosY[i] + ALIEN_H);
        }
      }
    }
    
    return 0;  // no-alien alive.
  }
  
  /*
  * moveAliens – called every frame, internally rate-limited to ALIEN_MOVE_MS.
  *
  * The whole grid shifts as one unit.  On a wall hit, the grid drops one row
  * and direction reverses; no horizontal step happens that tick.
  * oldOffset is saved so renderAliens knows which strip to erase.
  */
  
  static void moveAliens(uint32_t now) {
    AlienGrid* ag = &gs.aliens;

  if (now - ag->lastMoveTime < ALIEN_MOVE_MS)
    return;

  ag->lastMoveTime = now;
  if (isAlienGridMt()) {
    initAlienGrid();
  }

  ag->oldOffsetX = ag->offsetX;
  ag->oldOffsetY = ag->offsetY;

  printNumber(ag->offsetY + ag->basePosY[2], 0, 0, 1, 0);

  int16_t nextX = ag->offsetX + (ALIEN_STEP * ag->dirX);
  ag->earToggle = !ag->earToggle;

  if (nextX < ALIEN_MIN_X || nextX > ALIEN_MAX_X) {
    /* Hit a wall: drop down, reverse direction, no horizontal step */

    // random fire on wall hit,
    // TODO: take this function out and only run in certain interval instead of
    // every wall hit...
    for (int j = 0; j < ALIEN_COLS; j++) {
      if (ag->ab[j].state == BULLET_READY && shouldFire(12))
        ag->ab[j].state = BULLET_FIRE;
    }
    ag->offsetY += ALIEN_DROP;
    ag->dirX *= -1;
  } else {
    ag->offsetX = nextX;
  }

  for (int j = 0; j < ALIEN_COLS; j++) {
    if (ag->ab[j].state == BULLET_READY)
      parkAlienBullet(j);
  }
  }

  /*
 * updateAlienFire – per-column independent fire timer.
 * Each column fires when its nextFireTime is reached,
 * then rolls a new random delay.
 */
static void updateAlienFire(uint32_t now) {
  AlienGrid* ag = &gs.aliens;
  for (int j = 0; j < ALIEN_COLS; j++) {
    if (ag->ab[j].state != BULLET_READY)
      continue; /* already in flight */

    int hasAlive = 0;
    for (int i = 0; i < ALIEN_ROWS; i++)
      if (ag->status[i][j] == 0) {
        hasAlive = 1;
        break;
      }
    if (!hasAlive)
      continue;

    if (now >= ag->nextFireTime[j]) {
      ag->ab[j].state = BULLET_FIRE;
      ag->nextFireTime[j] = now + randomFireDelay();
    }
  }
}
  
  /*
  * 9. COLLISION
  *
  */
  static int checkCollision(uint16_t o1X,
    uint16_t o1Y,
    uint16_t o1w,
    uint16_t o1h,
    uint16_t o2X,
    uint16_t o2Y,
    uint16_t o2w,
    uint16_t o2h) {
      if (o1X + o1w <= o2X)
      return 0;
      if (o1X >= o2X + o2w)
      return 0;
      if (o1Y + o1h <= o2Y)
      return 0;
      if (o1Y >= o2Y + o2h)
      return 0;
      return 1;
    }
    
// ?Alien bullet reset
static void resetAlienBullet(int col) {
  AlienGrid* ag = &gs.aliens;
  Bullet* b = &ag->ab[col];
  /* Erase both positions */
  fillRectangle(b->coords.x, b->coords.y, BULLET_W, BULLET_H, 0);
  fillRectangle(b->coords.oldX, b->coords.oldY, BULLET_W, BULLET_H, 0);
  parkAlienBullet(col);
}

// ? Player Bullet Reset
static void resetPlayerBullet(void) {
  Bullet* b = &gs.bullet;
  gs.bullet.state = BULLET_READY;

  fillRectangle(b->coords.oldX, b->coords.oldY, BULLET_W, BULLET_H + 5, 0);

  gs.bullet.coords.x = gs.bullet.coords.oldX =
      gs.ship.coords.x + BULLET_OFFSET_X;
  gs.bullet.coords.y = gs.bullet.coords.oldY =
      gs.ship.coords.y - BULLET_OFFSET_Y;
}
 /*
 * repairAliensUnderRect – after erasing a rect (rx,ry,rw,rh) to black,
 * redraw any alive alien who overlaps bullet.
 */
static void repairAliensUnderRect(uint16_t rx,
                                  uint16_t ry,
                                  uint16_t rw,
                                  uint16_t rh) {
  AlienGrid* ag = &gs.aliens;
  for (int i = 0; i < ALIEN_ROWS; i++) {
    for (int j = 0; j < ALIEN_COLS; j++) {
      if (ag->status[i][j] != 0)
        continue;
      uint16_t ax = (uint16_t)(ag->offsetX + ag->basePosX[j]);
      uint16_t ay = (uint16_t)(ag->offsetY + ag->basePosY[i]);
      if (checkCollision(ax, ay, ALIEN_W, ALIEN_H, rx, ry, rw, rh)) {
        /* Which sprite to use for this row */
        const uint16_t* spr = (i == 0)   ? redAlien[ag->earToggle]
                              : (i == 1) ? greenAlien[ag->earToggle]
                                         : blueAlienBoth[ag->earToggle];
        putImage(ax, ay, ALIEN_W, ALIEN_H, spr, 1, 0);
      }
    }
  }
}

static int updateAlienBulletCollision(void) {
  AlienGrid* ag = &gs.aliens;
  int hit = 0;
  for (int j = 0; j < ALIEN_COLS; j++) {
    Bullet* b = &ag->ab[j];
    if (b->state != BULLET_FIRE)
      continue;
    if (checkCollision(gs.ship.coords.x, gs.ship.coords.y, SHIP_W, SHIP_H,
                       b->coords.x, b->coords.y, BULLET_W, BULLET_H)) {
      resetAlienBullet(j);
      hit = 1;
    }
  }
  return hit;
}

