CDiamondGit/stm32SpaceInvaders/src/main.c
  /* Re-initialise all game state */
  initGameState();

  /* Redraw the initial scene */
  renderAliens();
  putImage(gs.ship.coords.x, gs.ship.coords.y, SHIP_W, SHIP_H, spaceShip, 1, 0);
  /* HUD line stays – was never erased */
}
 void playing(AppState *as) {
                  
  clearDisplay();
                  
  /* Game */
  initGameState();
                  
  /* Initial draw */
  renderAliens();
  putImage(gs.ship.coords.x, gs.ship.coords.y, SHIP_W, SHIP_H, spaceShip, 1, 0);
  drawLine(0, HUD_LINE_Y, SCREEN_W, HUD_LINE_Y, HUD_LINE_COLOR);
  
  PlayingState currentPlayingState = GAMERUNNING;
  int done =0;

  while (!done) {
      int done2=0;
  switch(currentPlayingState){
    
    case GAMERUNNING:
      
    /* Game loop */
   while (1) {
    uint32_t now = milliseconds;
    if (now - lastUpdate < FRAME_DELAY)
      continue;
    lastUpdate = now;

    /* Advance bullet */
    if (gs.bullet.state == BULLET_FIRE) {
      gs.bullet.coords.y -= gs.bullet.speed;
      if (gs.bullet.coords.y < 5) {
        resetPlayerBullet();
        // renderPlayerBullet();
      }
    } else {
      gs.bullet.coords.x = gs.ship.coords.x + BULLET_OFFSET_X;
      gs.bullet.coords.y = gs.ship.coords.y - BULLET_OFFSET_Y;
    }

    AlienGrid* ag = &gs.aliens;

    for (int j = 0; j < ALIEN_COLS; j++) {
      Bullet* b = &ag->ab[j];
      if (b->state == BULLET_FIRE) {
        b->coords.y += b->speed; /* alien bullets go DOWN */
        if (b->coords.y > HUD_LINE_Y - 5)
          resetAlienBullet(j);
      }
      /* READY bullets track the grid in moveAliens/parkAlienBullet */
    }

    handleInput();   /* buttons-> positions*/
    moveAliens(now); /* now = time, timer-> alien grid shift */
    updateAlienFire(now);
    updatePlayerCollision(); /* bullet    -> alien grid       */
    /*
    TODO :
    implement alien bullet. | redrawing every alien that has overlapped with
    bullet
    */

    if (updateAlienBulletCollision()) {
      resetGame();
      continue;
    }

    if (checkGameOver()) {
      resetGame();
      stopSound();
      current_tune_notes = 0;
      current_tune_times = 0;
      current_tune_note_count = 0;
      current_repeat_tune = 0;
      current_note_index = 0;
      current_note_timer = 0;
      continue;
    }
    renderScene(); /* positions -> screen           */
  }
  break;
  case PAUSE:
    *as = MAINMENU;
    done =1;
  break;
  case GAMEOVER:
  break;
  default: 
  break;
  }
  
}
}



/*
* 10. MAIN
*
*/
int main(void) {
  /* Hardware */
  initClock();
  initSysTick();
  setupIO();
  initSound();
  
  // Game Begins
  while(1)
  {
    // Switch statement for our Game State
    switch (currentAppState){
      
      case MAINMENU:
      mainMenu(&currentAppState);
      break;
      case HELP:
      help(&currentAppState);
      break;
      case PLAYING:
      playing(&currentAppState);
      break;
    
      default:
      break;
    }
    
  }
  
  return 0;
}